<?php
// +----------------------------------------------------------------------
// | 广西西途比网络科技有限公司 www.c2b666.com
// +----------------------------------------------------------------------
// | 功能描述: 管理员管理
// +----------------------------------------------------------------------
// | 时　　间: 2017/12/6 19:07
// +----------------------------------------------------------------------
// | 代码创建: 西途比
// +----------------------------------------------------------------------
// | 版本信息: V1.0.0
// +----------------------------------------------------------------------
// | 代码修改:（修改人 - 修改时间）
// +----------------------------------------------------------------------

class Wechat_send_msg extends Wechat
{
    public function sendPicAndWord($access_token) {
        $url = "https://api.weixin.qq.com/cgi-bin/message/custom/send?access_token=" . $access_token;
        $openid = "oRfR2v3T0tq1lG6TNmHlf4bmOArE";
        //发送图文
        $data = '{
            "touser": "' . $openid . '", 
            "msgtype": "news", 
            "news": {
                "articles": [{
                        "title": "省游灯,哈哈哈", 
                        "url": "https://www.syd666.com/Webapp/App/?v=1.0.0#/native/specialtyDetails/15"
                    }
                ]}
            }';
        $result = $this->https_request($url, $data);
        return $result;
    }

}

